{"version":"1","records":[{"hierarchy":{"lvl1":"Abstract"},"type":"lvl1","url":"/abstract","position":0},{"hierarchy":{"lvl1":"Abstract"},"content":"E=m*c^2","type":"content","url":"/abstract","position":1},{"hierarchy":{"lvl1":"Conclusion and Outlook"},"type":"lvl1","url":"/conandout","position":0},{"hierarchy":{"lvl1":"Conclusion and Outlook"},"content":"","type":"content","url":"/conandout","position":1},{"hierarchy":{"lvl1":"Conclusion and Outlook","lvl2":"Orientation and strain of HPT"},"type":"lvl2","url":"/conandout#orientation-and-strain-of-hpt","position":2},{"hierarchy":{"lvl1":"Conclusion and Outlook","lvl2":"Orientation and strain of HPT"},"content":"","type":"content","url":"/conandout#orientation-and-strain-of-hpt","position":3},{"hierarchy":{"lvl1":"Conclusion and Outlook","lvl2":"Data analysis and challenges"},"type":"lvl2","url":"/conandout#data-analysis-and-challenges","position":4},{"hierarchy":{"lvl1":"Conclusion and Outlook","lvl2":"Data analysis and challenges"},"content":"","type":"content","url":"/conandout#data-analysis-and-challenges","position":5},{"hierarchy":{"lvl1":"Conclusion and Outlook","lvl2":"4D-STEM at usi"},"type":"lvl2","url":"/conandout#id-4d-stem-at-usi","position":6},{"hierarchy":{"lvl1":"Conclusion and Outlook","lvl2":"4D-STEM at usi"},"content":"better detectors, intelligent detectors? Write only what you want to read later?\n\ndata management, INCYTE?\n\n4D-STEM together with EDX\n\n4D-STEM + tomography?\n\ndirect electron detectors, faster network connections, glasfiber etc.\n\ncompute on GPU with paralleization/acceleration with CUDA\n\nTry with lower doses with soft materials, e.g polymers, biological samples, maybe in combination with cryo","type":"content","url":"/conandout#id-4d-stem-at-usi","position":7},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector"},"type":"lvl1","url":"/experimental","position":0},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector"},"content":"[ Jeong et al., 2021, ]","type":"content","url":"/experimental","position":1},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector","lvl2":"Experimental setup and measurement Instumentation"},"type":"lvl2","url":"/experimental#experimental-setup-and-measurement-instumentation","position":2},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector","lvl2":"Experimental setup and measurement Instumentation"},"content":"Which TEM, which camera, microdiffraction mode etc.\n\ntikz image of the setup","type":"content","url":"/experimental#experimental-setup-and-measurement-instumentation","position":3},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector","lvl2":"High-pressure torsion (HPT) specimen"},"type":"lvl2","url":"/experimental#high-pressure-torsion-hpt-specimen","position":4},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector","lvl2":"High-pressure torsion (HPT) specimen"},"content":"[\n\nAzzeddine et al., 2022][\n\nVorhauer & Pippan, 2004][\n\nEdalati et al., 2011][\n\nNakazawa et al., 2023][\n\nZhilyaev & Langdon, 2008][\n\nEdalati & Horita, 2016][\n\nKim, 2001]\n\n[ Xu et al., 2007, ]\n\ndescribe manufacturing; pressured, rotated, annealed etc.\n\ntalk to HW about the properties and preparation using FIB\n\nwhy HPT? graph? fine grain structure etc.\n\nWhat is interesting about this sample? How can 4D-STEM help understand its properties?","type":"content","url":"/experimental#high-pressure-torsion-hpt-specimen","position":5},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector","lvl2":"boron-doped diamond on graphene"},"type":"lvl2","url":"/experimental#boron-doped-diamond-on-graphene","position":6},{"hierarchy":{"lvl1":"4D-STEM utilizing a scintillator based CMOS detector","lvl2":"boron-doped diamond on graphene"},"content":"describe its manufacturing, thank LOT\n\nused as a proxy, dataset was already available, meassured by CO\n\nWhat is interesting about this sample? How can 4D-STEM help understand its properties?","type":"content","url":"/experimental#boron-doped-diamond-on-graphene","position":7},{"hierarchy":{"lvl1":"Welcome"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Welcome"},"content":"Welcome to the dedicated website for my master’s thesis on...","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Introduction"},"type":"lvl1","url":"/introduction","position":0},{"hierarchy":{"lvl1":"Introduction"},"content":"This introductory chapter gives a brief overview/key concepts\n\nwhy is this research important and interesting? Not to technical here\n\nfrom electron/matter interaction to TEM to STEM to 4D-STEM","type":"content","url":"/introduction","position":1},{"hierarchy":{"lvl1":"Introduction","lvl2":"Imaging with fast electrons"},"type":"lvl2","url":"/introduction#imaging-with-fast-electrons","position":2},{"hierarchy":{"lvl1":"Introduction","lvl2":"Imaging with fast electrons"},"content":"Why is this research interesting? Why should we do it? Why are we able to do it now? Why is now the best time?\n\ncatchy introductory sentences here!\n\nEM came a long way from photographic film to high-end cameras/direct electron detectors, alongside with increasingly large datasets, giving insides to/helps gain information on the structure/composition etc. of materials\n\nmaybe contrast the developments in EM, higher and higher resolution/ data intensive measurments etc. with the development of computing power/its increase over time, especially in the age of AI, everyone has access to powerfull computational methods/cluster/hardware, complete industries and research interests shifted because of new technologie\n\nmaterials research gets accelerated by the advances in hardware and software\n\nWhy image with electrons in the first place?\nmaybe put the graph in section experimental in somethoing like this: [[messaufbau2.png]]\n\nelectrons show a strong interactions with matter, due to their mass + velocity in the TEM, stronger interactions than light\n\ndifferent interactions with matter; different detectors/information can be observed\n\nelastic vs. inelastic scattering\n\n![[electronww.svg]]\n\nFig 1: Schematic representation of different electron interactions with a thin specimen, BSE and SE like in SEM + transmitted electrons can be used for EELS etc.\n\nProperties of electrons?\n\nResolution?\n\nRelativistic wavelength/mass? Higher acceleration = shorter wavelength = higher resolution, but at a cost...\\lambda = \\frac{h}{\\sqrt{2 m_0 eV (1+ \\frac{eV}{2 m_0 c^2})}}\n\nby this metric we expect a resolution of ... for a acceleration voltage of 200keV...","type":"content","url":"/introduction#imaging-with-fast-electrons","position":3},{"hierarchy":{"lvl1":"Introduction","lvl2":"Modes of Transmission electron microscopy"},"type":"lvl2","url":"/introduction#modes-of-transmission-electron-microscopy","position":4},{"hierarchy":{"lvl1":"Introduction","lvl2":"Modes of Transmission electron microscopy"},"content":"[ Tsuda & Tanaka, 1999, ]\n\nHow do we use these fast electrons for microscopy?\n\ndirecting a beam of electrons trough a thin sample (usually smaller 100nm), electrons interact with the sample in various ways which can be detected, e.g scattering etc.\n\nbasic components of a TEM? Electrongun, Focussing with electromagnetic lenses, imaging with detectors etc.\n\nWhich TEM modi are there?\n\nshortly describe different modi: TEM-BF, TEM-DF, STEM-BF, STEM-ADF/HAADF\n\nIn TEM the imaging modes can be selected by the objective aperture, is the aperture centered on the direct beam, usually the brightest spot, a bright-field image is formed\n\ndark-field images are formed when the aperture is centered around a diffracted spot or the beam is tiled in a way so that a diffracted spot is on axis, probably best as it minimizes abberations?\n\nImaging contrast is inverted for BF- and DF-TEM, specimen/parts of the specimen that scatters strongly appear dark in a BF image as they deviate a significant amount of electrons from their trajectory. In DF-TEM on the other hand they would up show as bright regions\n\nSTEM: convergent beam instead of a parallel beam, rastered over the sample, and interaction/transmission in each position is detected\n\nSimilarly to the TEM mode there are BF and DF in the STEM mode, the signal collected is determined by the chosen detector and the camera length\n\nschematic representation of these four modi can be seen in Figrue 123\n\n![[TEM_modes.svg]]\n\nFig 2: Schematic representation of BF and DF imaging in TEM and STEM mode. a)  BF imaging in the TEM mode by selecting the unscattered beam through the objective aperture. b) DF imaging is obtained by tilting the beam such that a diffracted beam is on-axis c) The on-axis  beam is collected by a BF detector in STEM mode, adjusted to a long camera length compared to DF-STEM d) The ADF and HAADF are annular detectors that collect the scattered beam at shorter camera lengths\n\nContrast? which information do i get from which mode?\n\nSAD easier to interpret than CBED?\n\nTEM: defects, crystal structure by diffracrion spots, easy to interpret\n\nSTEM DF: defects, dislocations, z-contrast","type":"content","url":"/introduction#modes-of-transmission-electron-microscopy","position":5},{"hierarchy":{"lvl1":"Introduction","lvl2":"From STEM to 4D-STEM"},"type":"lvl2","url":"/introduction#from-stem-to-4d-stem","position":6},{"hierarchy":{"lvl1":"Introduction","lvl2":"From STEM to 4D-STEM"},"content":"[ Pennycook, 2016, ]\nWhy is it called 4D-STEM? How does it work?\n\noperation principle, scanning 2D area in real space, collect a 2D CBED diffraction pattern for each real space probe position\n\ngenerates large datasets,  what is in the dataset? which information can i get?\n\n![[4DSTEM_Overview.svg]]\n\nFig 3\n\nWhat is the challenge?\n\nwhy are the datasets so large? show simple calculation\n\ncommercial software and open source software available to process data -> different options such as py4dastem, hyperspy, libertem, etc.\n\npy4DSTEM chosen because...\n\ncomputational methods needed but require large system memory -> computing on a cluster\n\nteaser for next chapter most relevant parameters, detectors + datamanagement and processing will be described in chapter theory","type":"content","url":"/introduction#from-stem-to-4d-stem","position":7},{"hierarchy":{"lvl1":"Introduction","lvl2":"Aim of this work"},"type":"lvl2","url":"/introduction#aim-of-this-work","position":8},{"hierarchy":{"lvl1":"Introduction","lvl2":"Aim of this work"},"content":"What exactly did we do? what will be shown on the following pages? where to find the code etc.?\n\nmeasuring 4DSTEM on the TEM at hand, FEI...\n\nprocessing the datasets we generated using the OMNI Cluster of university of siegen\n\ngreat challenge of processing large datasets, we try to face using py4DSTEM, a package provided by C. ophus et all \n\n[ Ophus et al., 2014, ]\n\ntry to establish a workflow for 4DSTEM measurments and datamangement/analysis\n\ncode for 4DSTEM can be found at link github, code written for this thesis can be found at my github\n\n![[amorph_crystalline.svg]]\n\nFig 4: maybe exclude this figure, too trivial...","type":"content","url":"/introduction#aim-of-this-work","position":9},{"hierarchy":{"lvl1":"Results and Discussion"},"type":"lvl1","url":"/resanddis","position":0},{"hierarchy":{"lvl1":"Results and Discussion"},"content":"demonstrate that we use the cluster successfully\n\nshow all ROIs on the lamellas of possible","type":"content","url":"/resanddis","position":1},{"hierarchy":{"lvl1":"Results and Discussion","lvl2":"Virtual imaging"},"type":"lvl2","url":"/resanddis#virtual-imaging","position":2},{"hierarchy":{"lvl1":"Results and Discussion","lvl2":"Virtual imaging"},"content":"compare virtal BF with real BF etc.","type":"content","url":"/resanddis#virtual-imaging","position":3},{"hierarchy":{"lvl1":"Results and Discussion","lvl2":"Strain mapping?"},"type":"lvl2","url":"/resanddis#strain-mapping","position":4},{"hierarchy":{"lvl1":"Results and Discussion","lvl2":"Strain mapping?"},"content":"","type":"content","url":"/resanddis#strain-mapping","position":5},{"hierarchy":{"lvl1":"Results and Discussion","lvl2":"Automated crystal orientation mapping (ACOM)"},"type":"lvl2","url":"/resanddis#automated-crystal-orientation-mapping-acom","position":6},{"hierarchy":{"lvl1":"Results and Discussion","lvl2":"Automated crystal orientation mapping (ACOM)"},"content":"","type":"content","url":"/resanddis#automated-crystal-orientation-mapping-acom","position":7},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM"},"type":"lvl1","url":"/theory","position":0},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM"},"content":"","type":"content","url":"/theory","position":1},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Ewald sphere and Laue zones"},"type":"lvl2","url":"/theory#ewald-sphere-and-laue-zones","position":2},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Ewald sphere and Laue zones"},"content":"Electron diffraction patterns arise from the interaction of incident electrons with the periodic crystal structure of a sample, following the principles of elastic scattering. A key concept for understanding the position of diffraction spots in these patterns is the Ewald sphere construction, introduced by Paul Peter Ewald. It provides a geometric framework to describe the relationship between the incident wave vector (\\vec{k_0}), the scattered wave vector (\\vec{k}), and the crystal’s reciprocal lattice. \n\nEwald (1921) The Ewald sphere is constructed in reciprocal space and represents all possible directions where diffraction can occur, governed by Bragg’s law:n \\lambda = 2 d sin(\\theta)\n\nwhere:\n\nn is an integer/the order of diffraction,\n\nλ is the wavelength of the incident electrons,\n\nd is the interplanar spacing of the crystal,\n\nand θ is the angle of incidence that satisfies the diffraction condition.\n\nThe radius of the sphere is inversely proportional to the wavelength λ. Given the short wavelength of electrons, typically in the order of picometers for high-energy electron beams, the radius of the Ewald sphere becomes very large. \n\n[ Delille et al., 2001, ] This leads to highly localized region of reciprocal space being intersected by the sphere, the resulting diffraction spots are often concentrated in relatively narrow rings, known as Laue zones. \n\n[ Maiwald et al., 2018, ] \n\n[ Zuo, 2005, ] These zones represent higher-order reflections as electrons diffract at higher angles, in contrast to the central disk of zero-order Laue zone (ZOLZ). [\n\nZuo, 2005]\n\n[ Nakazawa et al., 2023, ] As shown in Figure 1, these zones can be visualized as circles in a 2D plane, representing the intersections of the reciprocal lattice with the Ewald sphere. The symmetry and spacing of these rings correspond to the underlying symmetry of the crystal lattice being studied.\n\n\n\nFigure 1:a) Ewald Sphere:  reciprocal lattice points which intersect with the sphere are diffraction points, marking the positions where Bragg conditions are fulfilled and constructive interference occurs. b) Laue Circles: In-plane view shows concentric rings which illustrate the Laue zones, with the innermost circle being the zero order laue zone (ZOLZ), and outer circles representing higher orders\n\nDue to the small wavelength and the resulting small curvature of the Ewalds sphere, most of the scattered electrons are present in the ZOLZ.","type":"content","url":"/theory#ewald-sphere-and-laue-zones","position":3},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Electron diffraction from convergent incident beam"},"type":"lvl2","url":"/theory#electron-diffraction-from-convergent-incident-beam","position":4},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Electron diffraction from convergent incident beam"},"content":"[\n\nLeBeau et al., 2010][\n\nChuvilin & Kaiser, 2005][\n\nMorniroli, 2006][\n\nDelille et al., 2001][\n\nBird & Saunders, 1992][\n\nWilliams & Carter, 2009][\n\nBustillo et al., 2021]\n\n[ Zuo & Tao, 2011, ]\n\nIn scanning transmission electron microscopy (STEM), unlike in transmission electron microscopy (TEM) where a nearly parallel electron beam is used, the electron beam is focused to a small point on the sample.\nThis so called convergent beam has a range of incident angles, each corresponding to a slightly different position on the Ewald sphere.\nSince the Ewald sphere is curved, the Bragg condition is met over a range of angles, broadening the diffraction spots into a disks which are called convergent beam electron diffraction (CBED) patterns.\nFigure 2 shows the resulting diffraction patterns of a parallel incident beam, often referred to as selected area diffraction (SAD) pattern and of a convergent incident beam, highlighting the difference in the formation of spots versus disks.\n\n![[CBED_vs_SAD.svg]]\n\nFig 2: Comparison of diffraction patterns obtained using Selected Area Diffraction (SAD) and Convergent Beam Electron Diffraction (CBED). The SAD pattern, produced with a parallel incident beam, features sharp diffraction spots, characteristic of long-range order in the sample. In contrast, the CBED pattern, generated with a convergent beam, displays diffraction disks, providing detailed local crystallographic information and allowing for finer spatial resolution.\n\nThe CBED patterns contain rich crystallographic information, with the type and quality of data obtained being highly dependent on the convergence angle α. However, there is a trade-off between achieving high resolution in real space and in diffraction space, as noted by ...\n\n[ Ophus, 2019, ] \n\n[ Zuo & Tao, 2011, ].\n\nAt smaller convergence angles, the electron probe has lower resolution in real space but provides higher resolution in reciprocal space. For very small angles, the disks closely resemble those in selected area diffraction (SAD), where the diffraction spots are sharp and well-defined.\nAs the convergence angle increases, the real-space resolution improves, but the diffraction resolution decreases due to the overlapping of the disks. This overlap occurs because the increased range of incident beam directions causes the disks to spread out and merge.\nFigure 3 illustrates the effect of the convergence angle α on disk position and size, as well as simulated CBED patterns for both small and large convergence angle α.\n\n![[CBED_alpha.svg|300]] ![[CBED_sim.svg|200]]\n\nFig 3: a) Two different convergence semiangles α resulting in dif-ferent CBED patterns; small angles (red cone) result in non-overlapping disks, increased angles (blue cone) results in broader and overlapping disks b) Simulated CBED patterns of silicium (111)choosing the zone axis as the propagation direction for two different convergence semiangles using abTEM, a python package for TEM simulation \n\n[ Madsen & Susi, 2021, ]","type":"content","url":"/theory#electron-diffraction-from-convergent-incident-beam","position":5},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Possible detector configuration"},"type":"lvl2","url":"/theory#possible-detector-configuration","position":6},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Possible detector configuration"},"content":"[\n\nLevin, 2021][\n\nNord et al., 2020][\n\nYang et al., 2015]\n\n[ Tate et al., 2016, ]\n\nThere is a variety of possible detector configurations available to detect CBED patterns, each with unique advantages and disadvantages.\nCharge-Coupled Devices (CCDs) were first introduced in electron microscopy in the 1980s. These detectors are coupled with a scintillator, such as single crystal Yttrium aluminium garnet (YAG), to convert incident electrons into photons, protecting the sensitive sensor from direct electron bombardment. The photons are transmitted to the CCD sensor through fiber optics, allowing the device to remain undamaged by high-energy electrons. In many cases, Peltier elements are used to cool the detector and reduce thermal noise, thereby improving image quality. CCDs operate by reading out the charge sequentially, line by line and pixel by pixel, making the process relatively slow compared to newer technologies such as complementary metal oxide semiconductor (CMOS) electronics.\n\n(Despite their historical importance, CCDs have certain limitations. Their Detective Quantum Efficiency (DQE) is lower compared to other systems, as the conversion of electrons to photons inherently results in some signal loss. In addition, radiation damage over time can degrade the performance, especially in terms of CTE, which governs how efficiently charge is transferred across the detector.)\n\nCMOS detectors offer several key advantages over CCDs. One of the main benefits is their faster readout speed, thanks to their ability to read out charge from each pixel simultaneously, rather than sequentially. Additionally, CMOS detectors suffer from less blooming, a phenomenon where charge spreads across adjacent pixels and blurs the image. This makes CMOS detectors better suited for high-speed imaging applications where clarity is critical.\n\nHowever, like CCDs, CMOS detectors are typically coupled with a scintillator to prevent damage from direct electron impacts. This intermediate photon conversion process lowers their DQE when compared to direct electron detectors. Nonetheless, the faster readout speed and reduced blooming make CMOS detectors a preferred choice in applications where these factors are more important than absolute sensitivity.\n\nDirect electron detectors are a significant improvement in terms of DQE because they do not require an intermediate step to convert electrons into photons. By detecting electrons directly, these detectors can achieve much higher sensitivity, making them ideal for high-resolution and low-dose imaging. Hybrid Pixel Detector (Pixel Array Detector - PAD) and Monolithic Active Pixel Sensor (MAPS) are the two main types of direct electron detectors.\n\nA hybrid pixel detector, also known as a pixel array detector (PAD), is an advanced type of direct electron detector. In this design, each pixel is read out in parallel, greatly enhancing data acquisition speed. The pixels are typically large and thick (e.g., 150 μm x 150 μm x 500 μm), which allows them to fully absorb high-energy electrons. This leads to a high dynamic range, making PADs well-suited for applications where precise electron energy measurements are crucial. However, the larger pixel size comes with the disadvantage of a lower total pixel count, which limits spatial resolution. An example of this type of detector is the Electron Microscopy Pixel Array Detector (EMPAD), described in detail by Tate et al. \n\n[ Tate et al., 2016, ]\n\nMonolithic Active Pixel Sensors (MAPS) are another form of direct electron detector, designed with much smaller pixel sizes (e.g., 6.5 μm x 6.5 μm x 8 μm). This smaller pixel size allows for a much higher spatial resolution, which is important for applications requiring detailed imaging at the nanoscale. However, the reduced pixel size also results in a lower dynamic range compared to hybrid pixel detectors, as smaller pixels absorb fewer electrons. MAPS detectors are typically radiation-hardened, making them more resilient in environments with high radiation exposure, such as in TEMs used for 4D-STEM experiments.\n\n![[detectors.svg]]\n\nFig 0: a) Indirect electron detector: Schematic of a Scintillator-coupled detector; electrons are converted to photons which reach the detector via fiber optic coupling b) Direct electron detector: electrons directly land on a radiation hardened sensor; MAPS vs EMPAD c) readout architecture: CCD; accumulated charge from each pixel is shifted in parallel, pixel by pixel and row by row, and sequencially converted to voltage, CTE must be high but is degredated by radiation demage? CMOS; charge is chonverted to voltage in each pixel and read out simultanouisly, much faster/advantagous speed\n\nFor the experiments in this thesis, we will be using a Gatan Continuum Camera.\n\nIt has a pixel format of 2048 x 2048 with 18-micron pixels\nThe camera operates at 200kV\nDQE at half Nyquist of 0.128 and a dynamic range of 76 dB,\n\nThe camera’s readout noise of 4.93 ADC counts and its frame rate of 94.2 fps","type":"content","url":"/theory#possible-detector-configuration","position":7},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Scan strategy and measurment"},"type":"lvl2","url":"/theory#scan-strategy-and-measurment","position":8},{"hierarchy":{"lvl1":"Theoretical introduction to 4D-STEM","lvl2":"Scan strategy and measurment"},"content":"[ Velazco et al., 2020, ] [\n\nVanrompay et al., 2019][\n\nLifshin et al., 2013][\n\nKovarik et al., 2016][\n\nSang et al., 2016][\n\nStevens et al., 2018][\n\nLiu, 2021][\n\nOrtega et al., 2021]\n\n[ Lifshin et al., 2013, ]\n\nUndersampling occurs at low magnifications when the probe size is smaller than the step size, meaning the beam covers only a portion of each pixel. As a result, the measured value at a given location represents only a fraction of the entire pixel, leading to less accurate measurements at lower magnifications .\n\nOversampling, on the other hand, happens at high magnifications when the probe size exceeds the step size. In this case, the signal becomes a summation from multiple pixels, resulting in blurred images. To address this, deconvolution methods paired with knowledge of the point spread function (PSF) can help maintain image resolution .\n\n![[sampling.svg|500]]\n\nFig x. Oversampling: probe size is larger than the step size, the signal measured is a summation of signals from multiple pixels, Undersampling:  beam is smaller than a pixel, meaning the measured value at a given location only represents a portion of the entire pixel\n\nSparse sampling is a technique used to reduce electron dose and acquisition time by scanning only a subset of pixels. Missing pixels are then filled in using reconstruction algorithms like inpainting, which rely on spatial frequencies to restore the image .\n\nA variant of this is random undersampling (R-US), where only a random fraction of pixels is scanned. However, the effectiveness of R-US can be limited by noise, particularly Poisson noise. Other methods, like tilt-undersampling (T-US), which involves fewer images with larger tilt increments, can be more advantageous in reducing dose .\n\nDifferent scan strategies can also be used in place of traditional raster scans. Spiral scans, like Archimedean or Fermat spirals, allow for faster scanning speeds and a more uniform electron dose distribution, though they may cause distortions and uneven sampling densities at higher speeds. Serpentine scans, which follow a back-and-forth path, improve dose uniformity but can introduce distortions due to hysteresis effects in the scanning coils. Hilbert scans provide a more isotropic path and distribute distortions more evenly from sample drift, making them useful for strain mapping, although short dwell times can lead to issues with scan system settling time  .\n\nChoosing the step size appropriately is critical for achieving the desired data. Undersampling results in a loss of information in at least one dimension but saves time, while oversampling introduces blur without adding valuable information .\n\nIt’s also essential to consider whether atomic resolution is necessary for your measurements. High resolution might not always be required, and reducing the electron dose per pixel can preserve sample integrity without compromising the data quality  .","type":"content","url":"/theory#scan-strategy-and-measurment","position":9}]}